renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_wifi_da16xxx/src/r_wifi_da16xxx_private.h
#elif WIFI_CFG_DEBUG_LOG == LOG_ERROR
/* Only ERROR messages will be logged. */
#define WIFI_LOG_ERROR( message )          printf_log_error message
#define WIFI_LOG_WARN( message )
#define WIFI_LOG_INFO( message )
#define WIFI_LOG_DEBUG( message )

#elif WIFI_CFG_DEBUG_LOG == LOG_NONE
#define WIFI_LOG_ERROR( message )
#define WIFI_LOG_WARN( message )
#define WIFI_LOG_INFO( message )
#define WIFI_LOG_DEBUG( message )
#endif /* WIFI_CFG_DEBUG_LOG */

#define WIFI_LOGGING_MAX_MESSAGE_LENGTH 256

#else
#error "Error! Invalid value for WIFI_CFG_LOGGING_OPTION. Please verify this macro in r_wifi_da16xxx_config.h"
#endif /* WIFI_CFG_LOGGING_OPTION */

/* Convert a macro value to a string */
#define WIFI_STRING_MACRO(str)          #str
/* Call WIFI_STRING_MACRO */
#define WIFI_STRING_CONVERT(arg)        (WIFI_STRING_MACRO(arg))

#define DA16XXX_MAX_CERT_SIZE               (2048) // Maximum length of certificate supported by DA16XXX.
#define DA16XXX_MAX_ALPN                    (3)    // Maximum number of ALPNs supported by DA16XXX.
#define DA16XXX_MAX_SNI_LEN                 (64)   // Maximum length of SNI supported by DA16XXX.
#define DA16XXX_CERT_START                  "\x1B"
#define DA16XXX_CERT_END                    "\x03"

#define DA16XXX_MQTT_TLS_CIPHER_SUITE_MAX   (17)   // Maximum number of TLS cipher suites supported by DA16XXX.
#define DA16XXX_MQTT_MAX_TOPIC_LEN          (64)   // Maximum total length for topics supported by DA16XXX.
#define DA16XXX_MQTT_MAX_PUBMSG_LEN         (2048) // Maximum total length for message supported by DA16XXX.
#define DA16XXX_MQTT_MAX_PUBTOPICMSG_LEN    (2063) // Maximum total length for message + topic supported by DA16XXX.
#define DA16XXX_MQTT_SUBTOPIC_MAX_CNT       (4)    // Maximum number of subscription topics allowed.

/**********************************************************************************************************************
 Global Typedef definitions
 *********************************************************************************************************************/
/* Common Timer */
typedef struct
{
    OS_TICK   threshold;        /* Timeout threshold */
    OS_TICK   tick_sta;         /* Tick of Timer start  */
} st_wifi_timer;

/* MQTT module status */
typedef enum
{
    DA16XXX_MQTT_CLOSE = 0,           /* Close MQTT Client service */
    DA16XXX_MQTT_OPEN,                /* Open MQTT Client service  */
    DA16XXX_MQTT_CONNECTED,           /* Connected MQTT broker     */
    DA16XXX_MQTT_DISCONNECTED,        /* Disconnected MQTT broker  */
} e_mqtt_module_status_t;

/* WIFI FIT module status */
typedef enum
{
    MODULE_DISCONNECTED = 0,    /* Disconnected WIFI module */
    MODULE_CONNECTED,           /* Connected WIFI module    */
    MODULE_ACCESSPOINT,         /* Connected access point   */
} e_wifi_module_status_t;

/* return code for common functions */
typedef enum
{
    ATCMD_OK             = 0,   /* OK      */
    ATCMD_ERR_MODULE_COM = -1,  /* cannot communicate module */
    ATCMD_ERR_TIMEOUT    = -2   /* communicate module timeout */
} e_atcmd_err_t;

/* UART HW flow control */
typedef enum
{
    RTS_OFF   = 0,              /* RTS = ON         */
    RTS_ON                      /* RTS = OFF        */
} e_flow_ctrl_t;

/* Result code */
typedef enum
{
    AT_OK                = 0,    /* OK                             */
    AT_UNKNOWN_CMD       = -1,   /* Unknown command                */
    AT_INSUF_PARAMS      = -2,   /* Insufficent parameter          */
    AT_TOO_MANY_PARAMS   = -3,   /* Too many parameters            */
    AT_INVALID_PARAM     = -4,   /* Wrong parameter value          */
    AT_UNSUPPORTED_FUN   = -5,   /* Unsupported function           */
    AT_NOT_CONNECTED_AP  = -6,   /* Not connected to an AP         */
    AT_NO_RESULT         = -7,   /* No result                      */
    AT_RESP_BUF_OVERFLOW = -8,   /* Response buffer overflow       */
    AT_FUNC_NOT_CONFIG   = -9,   /* Function is not configured     */
    AT_CMD_TIMEOUT       = -10,  /* Command timeout                */
    AT_NVRAM_WR_FAIL     = -11,  /* NVRAM write failure            */
    AT_RETEN_MEM_WR_FAIL = -12,  /* Retention memory write failure */
    AT_INTERNAL_TIMEOUT  = -97,  /* Internal timeout               */
    AT_INTERNAL_ERROR    = -98,  /* Internal error                 */
    AT_UNKNOWN           = -999  /* Undefined error                */
} e_rslt_code_t;

typedef enum
{
    DATA_NOT_FOUND = 0,
    DATA_FOUND,
} e_atcmd_read_t;

typedef enum
{
    DA16XXX_HTTP_CLOSE = 0,
    DA16XXX_HTTP_OPEN,
} da16xxx_http_status_t;

typedef enum
{
    DA16XXX_OTA_CLOSE = 0,
    DA16XXX_OTA_OPEN,
} da16xxx_ota_status_t;

/**********************************************************************************************************************
 External global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global functions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: at_send_raw
 * Description  : Send raw AT commands on UART.
 * Arguments    : data
 *                length
 * Return Value : ATCMD_OK
 *                ATCMD_ERR_MODULE_COM
 *                ATCMD_ERR_TIMEOUT
 *********************************************************************************************************************/
e_atcmd_err_t at_send_raw (uint8_t WIFI_FAR *data, uint16_t const length);

/**********************************************************************************************************************
 * Function Name: at_send
 * Description  : Send AT commands on UART.
 * Arguments    : cmd
 * Return Value : ATCMD_OK
 *                ATCMD_ERR_MODULE_COM
 *                ATCMD_ERR_TIMEOUT
 *********************************************************************************************************************/
e_atcmd_err_t at_send (const char *cmd, ...);

/**********************************************************************************************************************
 * Function Name: at_recv
 * Description  : Receive response and return RESULT CODE.
 * Arguments    : none
 * Return Value : AT_OK
 *                AT_UNKNOWN_CMD
 *                AT_INSUF_PARAMS
 *                AT_TOO_MANY_PARAMS
 *                AT_INVALID_PARAM
 *                AT_UNSUPPORTED_FUN
 *                AT_NOT_CONNECTED_AP
 *                AT_NO_RESULT
 *                AT_RESP_BUF_OVERFLOW
 *                AT_FUNC_NOT_CONFIG
 *                AT_CMD_TIMEOUT
 *                AT_NVRAM_WR_FAIL
 *                AT_RETEN_MEM_WR_FAIL
 *                AT_INTERNAL_TIMEOUT
 *                AT_INTERNAL_ERROR
 *********************************************************************************************************************/
e_rslt_code_t at_recv (void);

/**********************************************************************************************************************
 * Function Name: at_exec
 * Description  : Send AT commands and Receive response on UART.
 *                Recommend using for AT basic command.
 * Arguments    : cmd
 * Return Value : Same as at_recv() function.
 *********************************************************************************************************************/
e_rslt_code_t at_exec (const char *cmd, ...);

/**********************************************************************************************************************
 * Function Name: at_exec_wo_mutex
 * Description  : Send AT commands and Receive response on UART.
 *                Recommend using for AT extended command.
 * Arguments    : cmd
 * Return Value : Same as at_recv() function.
 *********************************************************************************************************************/
e_rslt_code_t at_exec_wo_mutex (const char *cmd, ...);

/**********************************************************************************************************************
 * Function Name: at_read
 * Description  : Read buffer with prefix. (example at_read("abcd = %s\r\n", p_char) )
 * Arguments    : response_fmt
 * Return Value : 0     : data not found
 *                other : data found
 *********************************************************************************************************************/
e_atcmd_read_t at_read (const char WIFI_FAR *response_fmt, ...);

/**********************************************************************************************************************
 * Function Name: at_read_wo_prefix
 * Description  : Read buffer without prefix. (example at_read_wo_prefix("%s\r\n", p_char) )
 * Arguments    : response_fmt
 * Return Value : 0     : data not found
 *                other : data found
 *********************************************************************************************************************/
e_atcmd_read_t at_read_wo_prefix (const char *response_fmt, ...);

/**********************************************************************************************************************
 * Function Name: at_move_to_next_line
 * Description  : Move pointer to next line of response buffer.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void at_move_to_next_line (void);

/**********************************************************************************************************************
 * Function Name: at_move_to_first_line
 * Description  : Set pointer to first line of response buffer.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void at_move_to_first_line (void);

/**********************************************************************************************************************
 * Function Name: at_get_current_line
 * Description  : Get pointer on current line of response buffer.
 * Arguments    : None
 * Return Value : Pointer of current line
 *********************************************************************************************************************/
uint8_t * at_get_current_line (void);

/**********************************************************************************************************************
 * Function Name: at_set_timeout
 * Description  : Set timeout threshold for AT command response (msec).
 * Arguments    : timeout_ms
 * Return Value : None
 *********************************************************************************************************************/
void at_set_timeout (uint32_t timeout_ms);

/**********************************************************************************************************************
 * Function Name: post_err_event
 * Description  : Post error event to user callback function.
 * Arguments    : err_event - error event
 *                sock_idx  - socket index
 * Return Value : None
 *********************************************************************************************************************/
void post_err_event (wifi_err_event_enum_t err_event, uint32_t sock_idx);

#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/**********************************************************************************************************************
 * Function Name: flow_ctrl_init
 * Description  : Initialise hardware flow.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void flow_ctrl_init (void);

/**********************************************************************************************************************
 * Function Name: flow_ctrl_set
 * Description  : Control RTS pin.
 * Arguments    : flow - Control direction
 * Return Value : None
 *********************************************************************************************************************/
void flow_ctrl_set (e_flow_ctrl_t flow);
#endif

/**********************************************************************************************************************
 * Function Name: uart_port_open
 * Description  : Open serial port.
 * Arguments    : None
 * Return Value : ATCMD_OK
 *                ATCMD_ERR_MODULE_COM
 *********************************************************************************************************************/
e_atcmd_err_t uart_port_open(void);

/**********************************************************************************************************************
 * Function Name: uart_port_close
 * Description  : Close serial port.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void uart_port_close(void);

#if WIFI_CFG_LOGGING_OPTION >= 2
/**********************************************************************************************************************
 * Function Name: printf_log_error
 * Description  : Print error log without freeRTOS logging module.
 * Arguments    : format - format message
 * Return Value : None
 *********************************************************************************************************************/
void printf_log_error (const char WIFI_FAR * format, ...);

/**********************************************************************************************************************
 * Function Name: printf_log_warn
 * Description  : Print warning log without freeRTOS logging module.
 * Arguments    : format - format message
 * Return Value : None
 *********************************************************************************************************************/
void printf_log_warn (const char WIFI_FAR * format, ...);

/**********************************************************************************************************************
 * Function Name: printf_log_info
 * Description  : Print information log without freeRTOS logging module.
 * Arguments    : format - format message
 * Return Value : None
 *********************************************************************************************************************/
void printf_log_info (const char WIFI_FAR * format, ...);

/**********************************************************************************************************************
 * Function Name: printf_log_debug
 * Description  : Print debug (AT command) log without freeRTOS logging module.
 * Arguments    : format - format message
 * Return Value : None
 *********************************************************************************************************************/
void printf_log_debug (const char WIFI_FAR * format, ...);
#endif /* WIFI_CFG_LOGGING_ENABLE */

/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_common_data
 * Description  : Handles incoming common data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_common_data(wifi_resp_type_t *type, wifi_recv_state_t *state, uint8_t data);

