renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_wifi_da16xxx/src/r_wifi_da16xxx_private.h
#if WIFI_CFG_TCP_SUPPORT == 1
/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_socket_data
 * Description  : Handles incoming socket data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_socket_data(wifi_resp_type_t *type, wifi_recv_state_t *state, uint8_t data);
#endif /* WIFI_CFG_TCP_SUPPORT */

#if WIFI_CFG_TLS_SUPPORT == 1
/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_secure_socket_data
 * Description  : Handles incoming TLS socket data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_secure_socket_data(wifi_resp_type_t *type, wifi_recv_state_t *state, uint8_t data);
#endif /* WIFI_CFG_TLS_SUPPORT */

#if WIFI_CFG_MQTT_SUPPORT == 1
/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_mqtt_data
 * Description  : Handles incoming MQTT data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_mqtt_data(wifi_resp_type_t *type, wifi_recv_state_t *state, uint8_t data);
#endif /* WIFI_CFG_MQTT_SUPPORT */

#if WIFI_CFG_HTTP_SUPPORT == 1
/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_http_data
 * Description  : Handles incoming HTTP data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_http_data(wifi_resp_type_t *type, wifi_recv_state_t *state, uint8_t data);
#endif /* WIFI_CFG_HTTP_SUPPORT */
#if WIFI_CFG_OTA_SUPPORT == 1
/**********************************************************************************************************************
 * Function Name: da16xxx_handle_incoming_ota_data
 * Description  : Handles incoming OTA data.
 * Arguments    : type
 *                state
 *                data
 * Return Value : none
 *********************************************************************************************************************/
void da16xxx_handle_incoming_ota_data (wifi_resp_type_t * type, wifi_recv_state_t * state, uint8_t data);

/**********************************************************************************************************************
 * Function Name: uart_set_recv_state
 * Description  : set uart recv state
 * Arguments    : state
 * Return Value : none
 *********************************************************************************************************************/
void uart_set_recv_state (wifi_recv_state_t state);

/**********************************************************************************************************************
 * Function Name: uart_set_recv_type
 * Description  : set uart recv type
 * Arguments    : type
 * Return Value : none
 *********************************************************************************************************************/
void uart_set_recv_type (wifi_resp_type_t type);

#endif /* WIFI_CFG_OTA_SUPPORT */
/**********************************************************************************************************************
 * Function Name: uart_port_set_baudrate
 * Description  : Set baud rate for serial port.
 * Arguments    : rate_num
 * Return Value : none
 *********************************************************************************************************************/
void uart_port_set_baudrate (uint32_t rate_num);

#endif /* R_WIFI_DA16XXX_PRIVATE_H */
